m=123456
ye=10000
print("欢迎光临！本即可提供取款、存款、查询以及密码服务")
print("----------------------------------------------------------------------")
print("请输入密码（6位数字）:")
x=int(input())
print("----------------------------------------------------------------------")
if x==m:
    print("请输入您的服务选择：1取款、2存款、3密码修改、4退出")
    f=int(input())
    if f==1:
        y=int(input("请输入取款金额："))
        print("取走",y,"元")
        z=10000-ye
        print("您的余额为",z,"元")
        z=ye
        print("----------------------------------------------------------------------")
    if f==2:
        a=int(input("请放入纸币（张）"))
        print("放入纸币",a,"张")
        b=ye+100*a
        print("您的余额为",b,"元")
        b=ye
        print("----------------------------------------------------------------------")
    if f==3:
        c=int(input("请输入新的密码"))
        cc=int(input("再次输入新的密码"))
        m=c
        print("您的密码已修改")
        print("----------------------------------------------------------------------")
    if f==4:
        print("退出")
else:
    print("密码错误")

    


 
